<template>
  <svg
    xmlns="http://www.w3.org/2000/svg"
    xmlns:xlink="http://www.w3.org/1999/xlink"
    viewBox="0 0 268.58 209.96"
  >
    <defs>
      <linearGradient
        id="未命名漸層_16-5"
        x1="97.02"
        y1="196.47"
        x2="113.75"
        y2="196.47"
        xlink:href="#未命名漸層_16"
      />
      <linearGradient
        id="未命名漸層_16-10"
        x1="107.29"
        y1="111.02"
        x2="120.25"
        y2="111.02"
        gradientTransform="translate(-30.08 -39.73)"
        xlink:href="#未命名漸層_16"
      />
      <linearGradient
        id="未命名漸層_16-2"
        x1="227.72"
        y1="140.85"
        x2="240.68"
        y2="140.85"
        gradientTransform="translate(18.53 -53.28) scale(1 1.15)"
        xlink:href="#未命名漸層_16"
      />
      <linearGradient
        id="未命名漸層_16-3"
        x1="85.23"
        y1="224"
        x2="92.27"
        y2="224"
        gradientTransform="translate(1.91 -16.43)"
        xlink:href="#未命名漸層_16"
      />
      <linearGradient
        id="未命名漸層_16-4"
        x1="151.65"
        y1="244.32"
        x2="175.42"
        y2="244.32"
        gradientTransform="translate(10.62 -13.87)"
        xlink:href="#未命名漸層_16"
      />
      <linearGradient
        id="未命名漸層_16"
        x1="238.87"
        y1="103.78"
        x2="260.17"
        y2="103.78"
        gradientUnits="userSpaceOnUse"
      >
        <stop offset="0.2" stop-color="#fffce3" />
        <stop offset="1" stop-color="#fff" stop-opacity="0" />
      </linearGradient>
      <linearGradient
        id="未命名漸層_16-6"
        x1="212.61"
        y1="196.88"
        x2="225.57"
        y2="196.88"
        xlink:href="#未命名漸層_16"
      />
      <linearGradient
        id="未命名漸層_16-7"
        x1="246.74"
        y1="251.06"
        x2="259.7"
        y2="251.06"
        gradientTransform="translate(-12.99 -21.81)"
        xlink:href="#未命名漸層_16"
      />
      <linearGradient
        id="未命名漸層_16-8"
        x1="215.36"
        y1="12.59"
        x2="229.46"
        y2="12.59"
        xlink:href="#未命名漸層_16"
      />
      <linearGradient
        id="未命名漸層_16-9"
        x1="176.74"
        y1="68.25"
        x2="195.55"
        y2="68.25"
        gradientTransform="translate(-12.32 -22.51)"
        xlink:href="#未命名漸層_16"
      />
    </defs>
    <title>1F</title>
    <g id="圖層_6" data-name="圖層 6">
      <polygon
        points="86.56 173.38 12.05 173.38 0.29 161.62 0.29 135.63 12.21 123.7 23.54 123.7 23.54 100.2 34.67 89.08 50.06 89.08 50.06 81.59 47 81.59 47 70.11 57.99 59.12 62.09 59.12 62.09 48.29 67.62 42.76 82.38 42.76 82.38 34.23 80.34 34.23 83.62 30.95 93.88 30.95 93.88 20.13 97.83 16.17 117.94 16.17 117.94 4.5 121.7 0.74 139.71 0.74 143.45 4.48 143.45 22.75 191 22.75 191 3.81 194.34 0.47 212.63 0.47 216.28 4.12 216.28 17.04 221.96 17.04 221.96 20.29 235.71 20.29 235.71 30.13 250.67 30.13 254.75 34.21 254.75 41.21 252.04 41.21 252.04 43.63 263.88 43.63 268.27 48.02 268.27 67.88 264.37 71.78 250.04 71.78 250.04 70.41 240.78 70.41 239.46 70.41 239.46 134.25 239.46 137.25 265 137.25 268.25 140.5 268.25 161.75 264.63 165.38 260.69 165.38 260.69 179.44 261.77 179.44 261.77 202.13 258.2 205.7 240.56 205.7 236.56 201.69 236.56 192.25 214.81 192.25 214.81 202.35 212.63 205.75 193.66 205.75 189.7 201.8 189.7 186.21 143.56 186.21 143.56 201.79 139.94 205.42 121.21 205.42 117.75 201.96 117.75 192.04 97.38 192.04 97.38 201.56 93.14 205.8 75.38 205.8 71.35 201.78 71.35 179.63 86.54 179.63 86.56 173.38"
        style="fill:#fffce3"
      />
      <rect
        x="238.87"
        y="70.31"
        width="21.29"
        height="66.94"
        style="fill:url(#未命名漸層_16)"
      />
      <rect
        x="246.25"
        y="102.45"
        width="12.96"
        height="11.81"
        transform="translate(253.17 -198.89) rotate(68.42)"
        style="fill:url(#未命名漸層_16-2)"
      />
      <rect
        x="87.13"
        y="204.29"
        width="7.04"
        height="6.56"
        transform="translate(290.85 84.54) rotate(90)"
        style="fill:url(#未命名漸層_16-3)"
      />
      <rect
        x="162.27"
        y="222.3"
        width="23.77"
        height="16.3"
        transform="translate(397.22 23.92) rotate(90)"
        style="fill:url(#未命名漸層_16-4)"
      />
      <rect
        x="97.02"
        y="191.81"
        width="16.73"
        height="9.31"
        style="fill:url(#未命名漸層_16-5)"
      />
      <rect
        x="212.61"
        y="192.25"
        width="12.96"
        height="9.25"
        style="fill:url(#未命名漸層_16-6)"
      />
      <rect
        x="233.76"
        y="224.63"
        width="12.96"
        height="9.25"
        transform="translate(473.1 426.13) rotate(180)"
        style="fill:url(#未命名漸層_16-7)"
      />
      <rect
        x="215.36"
        y="8.15"
        width="14.1"
        height="8.9"
        style="fill:url(#未命名漸層_16-8)"
      />
      <rect
        x="164.42"
        y="37.75"
        width="18.81"
        height="15.98"
        transform="translate(120.71 187.19) rotate(-90)"
        style="fill:url(#未命名漸層_16-9)"
      />
      <rect
        x="77.21"
        y="67.05"
        width="12.96"
        height="8.48"
        transform="translate(160 110.21) rotate(180)"
        style="fill:url(#未命名漸層_16-10)"
      />
      <slot name="Registration" />
      <slot name="Exhibition" />
      <path
        class="cls-13"
        d="M201.43,137.35c-.09.45-.35,1.44-.41,1.59h-4.6v-.16c.85-.12.9-.2.9-1v-3.93c0-.87-.07-.92-.81-1v-.16h2.82v.16c-.73.13-.8.2-.8,1V138c0,.61.16.67.65.67h.58a1.06,1.06,0,0,0,.92-.31,3.73,3.73,0,0,0,.6-1Z"
        transform="translate(-7.38 -32.38)"
      />
      <path
        class="cls-13"
        d="M204.2,134.7a2.18,2.18,0,1,1-2.18,2.21A2.18,2.18,0,0,1,204.2,134.7Zm-.13.23c-.5,0-.77.54-.77,1.69s.37,2.23,1,2.23c.38,0,.77-.26.77-1.79C205,135.71,204.64,134.93,204.07,134.93Z"
        transform="translate(-7.38 -32.38)"
      />
      <path
        class="cls-13"
        d="M208.81,134.88a2.74,2.74,0,0,1,.58-.18,1.87,1.87,0,0,1,1.9,2,2.44,2.44,0,0,1-2.41,2.39,4.28,4.28,0,0,1-1.6-.32c0-.23,0-.47,0-.71v-4.71c0-.65,0-.7-.53-.84v-.14a7.07,7.07,0,0,0,1.66-.33c0,.11,0,1,0,1.35V135Zm-.4,3.19a.68.68,0,0,0,.06.31.87.87,0,0,0,.73.41c.52,0,.86-.67.86-1.86s-.61-1.77-1.25-1.77a1.49,1.49,0,0,0-.4.06Z"
        transform="translate(-7.38 -32.38)"
      />
      <path
        class="cls-13"
        d="M213.8,134.88a2.74,2.74,0,0,1,.58-.18,1.86,1.86,0,0,1,1.9,2,2.44,2.44,0,0,1-2.41,2.39,4.23,4.23,0,0,1-1.59-.32c0-.23,0-.47,0-.71v-4.71c0-.65,0-.7-.54-.84v-.14a7.07,7.07,0,0,0,1.66-.33c0,.11,0,1,0,1.35V135Zm-.39,3.19a.69.69,0,0,0,.05.31.87.87,0,0,0,.73.41c.52,0,.86-.67.86-1.86s-.61-1.77-1.25-1.77a1.37,1.37,0,0,0-.39.06Z"
        transform="translate(-7.38 -32.38)"
      />
      <path
        class="cls-13"
        d="M221.05,135c-.41.1-.48.19-.74.78s-.57,1.36-1.11,2.81-.76,2.17-.91,2.7c-.07.22-.17.27-.29.27-.29,0-.65-.22-.65-.52,0-.09,0-.18.24-.32a2.11,2.11,0,0,0,.85-.88,4.15,4.15,0,0,0,.19-.44,1.74,1.74,0,0,0-.15-.53c-.44-1.24-1.08-2.69-1.31-3.27-.17-.38-.22-.51-.65-.6v-.15h2.24V135c-.54.1-.56.18-.42.52l.89,2.26c.28-.75.59-1.5.78-2.18.12-.37.09-.48-.57-.6v-.15h1.61Z"
        transform="translate(-7.38 -32.38)"
      />
      <slot name="Room105" />
      <slot name="Room103" />
      <slot name="Room102" />
      <slot name="Room101D" />
      <slot name="Room101C" />
      <slot name="Room101B" />
      <slot name="Room101A" />
    </g>
    <g id="圖層_3" data-name="圖層 3">
      <polyline
        class="cls-21"
        points="80.33 173.38 12.05 173.38 0.5 162.13 0.5 135.63 12.05 124.13 24 124.13 23.75 100.38 34.96 89.38 50.06 89.38 50.06 81.38 47 81.38 47.25 70.11 58 59.13 62.09 59.13 62.09 48.29 67.54 42.79 83.04 42.79"
      />
      <polyline
        class="cls-21"
        points="86.56 170.75 86.56 179.88 97.25 179.88 97.25 192.13 117.66 192.13 117.66 180 120.44 180"
      />
      <polyline
        class="cls-21"
        points="128.38 180 142.14 180 142.14 186.13 158.75 186.13"
      />
      <polyline
        class="cls-21"
        points="174.5 186.13 213.23 186.13 213.5 192.25 238.93 192.25 238.63 165"
      />
      <polyline
        class="cls-21"
        points="189.88 186.56 189.88 201.88 193.5 205.75 212.63 205.75 215.68 201.5"
      />
      <polyline
        class="cls-21"
        points="117.71 192.54 117.71 201.88 121.21 205.71 139.96 205.71 143.56 201.79 143.56 186.29"
      />
      <polyline
        class="cls-21"
        points="86.13 179.63 71.51 179.63 71.51 201.63 75.38 205.71 93.63 205.71 97.63 201.13"
      />
      <polyline
        class="cls-21"
        points="236.38 201.38 240 205.75 258.25 205.75 262.25 202.13 261.76 179.13 260.54 179.13 260.54 165.38 264.63 165.38 268 161.75 268 140.75 264.63 137.25 239.44 137.25 239.44 132.69"
      />
      <line class="cls-21" x1="239.46" y1="117.46" x2="239.46" y2="91.63" />
      <line class="cls-21" x1="239.46" y1="76.25" x2="239.46" y2="71.23" />
      <polyline
        class="cls-21"
        points="83.54 34.23 80.04 34.23 83.04 30.38 94.25 30.38 94.25 20.13 97.88 16.63 117.71 16.63 117.71 4.5 121.25 0.75 139.94 0.75 143.5 4.44 143.5 22.75 158.94 22.75"
      />
      <polyline
        class="cls-21"
        points="174.44 22.63 191 22.63 191 3.81 194 0.5 212.63 0.5 216.13 4 216.13 8.38"
      />
      <line class="cls-21" x1="216.13" y1="16.29" x2="216.13" y2="25.46" />
      <polyline
        class="cls-21"
        points="216.54 17.04 221.96 17.04 221.96 20.29 235.71 20.29 235.71 30.13 250.38 30.13 254.25 34 254.25 41.38 252.21 41.38 252.21 43.63 264.46 43.63 268.08 47.25 268.08 68.29 264.48 71.9 249.71 71.9 249.71 69.13 267.25 69.13"
      />
      <polyline
        class="cls-21"
        points="213.63 25.66 213.63 47.76 213.63 70.96 228.63 70.96"
      />
    </g>
    <g id="圖層_4" data-name="圖層 4">
      <polyline
        class="cls-22"
        points="24.21 116.88 68.73 116.88 68.73 150.88 74.13 150.88 74.13 161.21 68.73 161.21"
      />
      <polyline class="cls-22" points="59.5 161.21 27.06 161.21 27.06 139.88" />
      <polyline
        class="cls-22"
        points="0.75 139.04 2.73 139.04 2.73 140.26 22.75 140.26"
      />
      <polyline
        class="cls-22"
        points="15.13 139.88 15.13 127.88 22.25 127.88 22.25 132.75"
      />
      <line class="cls-22" x1="25.13" y1="132.63" x2="28.52" y2="132.63" />
      <line class="cls-22" x1="28.52" y1="134.63" x2="28.52" y2="130.25" />
      <line class="cls-22" x1="39.03" y1="116.82" x2="28.99" y2="126.86" />
      <polyline
        class="cls-22"
        points="97.38 150.75 97.38 161.21 86.19 161.21 83.47 158.5 83.47 50.52 86.18 47.81 97.38 47.81 97.38 58"
      />
      <line class="cls-22" x1="83.69" y1="62.38" x2="97.38" y2="62.38" />
      <line class="cls-22" x1="117.71" y1="62.38" x2="131.54" y2="62.38" />
      <path
        class="cls-22"
        d="M127.62,94.92"
        transform="translate(-7.38 -32.38)"
      />
      <polyline
        class="cls-22"
        points="155.23 151.63 155.23 161.38 178.43 161.38 178.43 138.69 158.13 138.69"
      />
      <line class="cls-22" x1="158.37" y1="150.03" x2="178.43" y2="150.03" />
      <line class="cls-22" x1="175.84" y1="138.9" x2="175.84" y2="113.96" />
      <polyline
        class="cls-22"
        points="175.5 94.47 175.5 70.31 157.98 70.31 157.98 71.47"
      />
      <polyline
        class="cls-22"
        points="178.13 70.31 178.13 48.31 155.23 48.31 155.23 57.56"
      />
      <line class="cls-22" x1="155.23" y1="62.38" x2="155.23" y2="71.47" />
      <line class="cls-22" x1="158.46" y1="59.31" x2="178.4" y2="59.31" />
      <polyline
        class="cls-22"
        points="143.34 22.94 128.38 22.94 128.38 31.92 144.63 31.92"
      />
      <line class="cls-22" x1="117.94" y1="17.03" x2="117.94" y2="25.22" />
      <line class="cls-22" x1="108.13" y1="17.03" x2="108.13" y2="29.16" />
      <polyline
        class="cls-22"
        points="119.94 25.66 119.94 29.16 112.75 29.16"
      />
      <polyline class="cls-22" points="94.25 30.38 103.13 30.38 103.13 29.16" />
      <line class="cls-22" x1="73.94" y1="43.16" x2="73.94" y2="64.28" />
      <line class="cls-22" x1="62.31" y1="59.41" x2="62.31" y2="71.22" />
      <line class="cls-22" x1="47.56" y1="71.22" x2="68.73" y2="71.22" />
      <line class="cls-22" x1="49.94" y1="71.47" x2="49.94" y2="81.59" />
      <polyline class="cls-22" points="64.06 71.47 64.06 84.09 74.25 84.09" />
      <line class="cls-22" x1="74.25" y1="71.34" x2="74.25" y2="81.22" />
      <line class="cls-22" x1="69" y1="94.16" x2="30.38" y2="94.16" />
      <polyline class="cls-22" points="50.29 89.66 50.29 92.03 69.15 92.03" />
      <line class="cls-22" x1="142.29" y1="25.66" x2="142.29" y2="31.92" />
      <line class="cls-22" x1="149.71" y1="22.94" x2="149.71" y2="31.67" />
      <polyline
        class="cls-22"
        points="157.54 25.25 157.54 31.67 154.96 31.67"
      />
      <polyline
        class="cls-22"
        points="175.73 22.94 175.73 31.67 178.88 31.67"
      />
      <line class="cls-22" x1="183.96" y1="22.94" x2="183.96" y2="31.67" />
      <line class="cls-22" x1="188.88" y1="31.83" x2="213.12" y2="31.83" />
      <line class="cls-22" x1="191.29" y1="25.46" x2="191.29" y2="31.67" />
      <line class="cls-22" x1="193.07" y1="23.25" x2="213.12" y2="23.25" />
      <polyline
        class="cls-22"
        points="228.63 70.96 228.63 52.42 267.88 52.42"
      />
      <polyline class="cls-22" points="241.04 64.58 241.04 60.5 267.88 60.5" />
      <polyline
        class="cls-22"
        points="228.63 58.92 235.54 58.92 235.54 57.33"
      />
      <polyline
        class="cls-22"
        points="175.66 186.13 175.66 177.44 179.03 177.44"
      />
      <line class="cls-22" x1="183.84" y1="186.13" x2="183.84" y2="177.44" />
      <polyline
        class="cls-22"
        points="188.91 177.44 191.28 177.44 191.28 186.13"
      />
      <line class="cls-22" x1="191.47" y1="180.13" x2="213.23" y2="180.13" />
      <line class="cls-22" x1="215.68" y1="158.19" x2="236.72" y2="158.19" />
      <line class="cls-22" x1="213.61" y1="161.45" x2="238.92" y2="161.45" />
      <polyline
        class="cls-22"
        points="228.78 158.19 228.78 145.81 228.78 137.25 213.41 137.25 213.41 185.75"
      />
      <line class="cls-22" x1="233.34" y1="137.25" x2="239.16" y2="137.25" />
      <polyline class="cls-22" points="238.67 140 265.53 140 267.72 142.19" />
      <polyline
        class="cls-22"
        points="247.67 140.26 247.67 158.79 259.31 158.79"
      />
      <path
        class="cls-22"
        d="M236.16,182.5h7a8.5,8.5,0,0,1,0,1.75"
        transform="translate(-7.38 -32.38)"
      />
      <line class="cls-22" x1="238.93" y1="165.22" x2="260.17" y2="165.22" />
      <line class="cls-22" x1="83.47" y1="146.87" x2="97.25" y2="146.87" />
      <line class="cls-22" x1="117.83" y1="146.87" x2="131.5" y2="146.87" />
      <polyline
        class="cls-22"
        points="140.91 139.69 140.91 146.88 149.81 146.88 155.09 146.88 155.09 140.26 157.96 140.26 157.96 71.47 155.38 71.47 140.54 71.47 140.54 62.38 155.46 62.38"
      />
      <line class="cls-22" x1="143.5" y1="137.81" x2="155.23" y2="137.81" />
      <polyline
        class="cls-22"
        points="142.14 180 142.14 177.44 144.81 177.44"
      />
      <line class="cls-22" x1="149.81" y1="186.13" x2="149.81" y2="177.44" />
      <polyline
        class="cls-22"
        points="157.68 186.13 157.68 177.44 154.56 177.44"
      />
      <line class="cls-22" x1="100.19" y1="180" x2="114.81" y2="180" />
      <line class="cls-22" x1="107.5" y1="191.81" x2="107.5" y2="180" />
      <polyline
        class="cls-22"
        points="71.57 110.31 74.13 110.31 74.13 99.06 71.57 99.06"
      />
      <polyline class="cls-22" points="63.92 50.36 62.09 50.36 73.94 50.36" />
      <line class="cls-22" x1="50.09" y1="79.5" x2="52.08" y2="79.5" />
      <line class="cls-22" x1="57.08" y1="71.47" x2="57.08" y2="79.5" />
      <line class="cls-22" x1="61.92" y1="79.5" x2="63.92" y2="79.5" />
    </g>
    <g id="圖層_5" data-name="圖層 5">
      <line class="cls-23" x1="120.25" y1="62.54" x2="120.25" y2="146.87" />
      <line class="cls-23" x1="83.47" y1="104.71" x2="157.96" y2="104.71" />
    </g>
    <g id="圖層_2" data-name="圖層 2">
      <rect class="cls-24" x="2.73" y="158.59" width="2.91" height="2.81" />
      <rect class="cls-24" x="25.61" y="158.59" width="2.91" height="2.81" />
      <rect class="cls-24" x="25.61" y="137.49" width="2.91" height="2.81" />
      <rect class="cls-24" x="2.73" y="137.49" width="2.91" height="2.81" />
      <rect class="cls-24" x="48.61" y="158.59" width="2.91" height="2.81" />
      <rect class="cls-24" x="71.51" y="158.59" width="2.91" height="2.81" />
      <rect class="cls-24" x="12.05" y="126.39" width="2.07" height="2.07" />
      <rect class="cls-24" x="25.8" y="114.63" width="2.72" height="2.72" />
      <rect class="cls-24" x="48.73" y="114.63" width="2.72" height="2.72" />
      <rect class="cls-24" x="48.73" y="91.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="48.73" y="68.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="34.96" y="92.35" width="2.12" height="2.12" />
      <rect class="cls-24" x="68.73" y="114.63" width="5.67" height="2.72" />
      <rect class="cls-24" x="68.73" y="91.75" width="5.67" height="2.72" />
      <rect class="cls-24" x="68.73" y="68.75" width="5.67" height="2.72" />
      <rect class="cls-24" x="68.73" y="137.54" width="5.67" height="2.72" />
      <rect class="cls-24" x="71.92" y="47.87" width="2.49" height="2.49" />
      <rect class="cls-24" x="83.39" y="32.09" width="2.39" height="2.14" />
      <rect class="cls-24" x="62.09" y="48.29" width="1.83" height="2.07" />
      <rect class="cls-24" x="94.8" y="47.76" width="2.45" height="5.54" />
      <rect class="cls-24" x="117.71" y="47.76" width="2.45" height="5.54" />
      <rect class="cls-24" x="140.91" y="47.76" width="2.45" height="5.54" />
      <rect class="cls-24" x="155.23" y="47.76" width="2.75" height="5.54" />
      <rect class="cls-24" x="175.73" y="47.76" width="2.75" height="5.54" />
      <rect class="cls-24" x="213.1" y="47.76" width="2.75" height="5.54" />
      <rect class="cls-24" x="189.73" y="47.76" width="3.71" height="5.54" />
      <rect class="cls-24" x="94.8" y="155.54" width="2.45" height="5.67" />
      <rect class="cls-24" x="117.66" y="155.54" width="2.45" height="5.67" />
      <rect class="cls-24" x="140.91" y="155.54" width="2.45" height="5.67" />
      <rect class="cls-24" x="155.23" y="155.54" width="2.45" height="5.67" />
      <rect class="cls-24" x="175.98" y="155.54" width="2.45" height="5.67" />
      <rect class="cls-24" x="213.23" y="155.54" width="2.45" height="5.67" />
      <rect class="cls-24" x="236.48" y="155.54" width="2.45" height="5.67" />
      <rect class="cls-24" x="259.31" y="158.54" width="2.45" height="2.67" />
      <rect class="cls-24" x="189.81" y="155.54" width="3.69" height="5.83" />
      <rect class="cls-24" x="94.66" y="137.54" width="2.72" height="2.72" />
      <rect class="cls-24" x="117.53" y="137.54" width="2.72" height="2.72" />
      <rect class="cls-24" x="140.78" y="137.54" width="2.72" height="2.72" />
      <rect class="cls-24" x="94.66" y="68.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="117.53" y="68.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="140.78" y="68.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="155.09" y="137.54" width="2.72" height="2.72" />
      <rect class="cls-24" x="155.09" y="114.71" width="2.72" height="2.72" />
      <rect class="cls-24" x="155.09" y="91.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="155.09" y="68.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="175.68" y="68.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="175.5" y="91.04" width="3.07" height="4.14" />
      <rect class="cls-24" x="213.09" y="68.75" width="2.72" height="2.72" />
      <rect class="cls-24" x="233.09" y="68.75" width="8.2" height="2.72" />
      <rect class="cls-24" x="188.91" y="68.34" width="5.26" height="3.53" />
      <rect class="cls-24" x="175.84" y="137.54" width="2.72" height="2.72" />
      <rect class="cls-24" x="175.28" y="113.96" width="3.28" height="4.58" />
      <rect class="cls-24" x="213.09" y="137.54" width="2.72" height="2.72" />
      <rect class="cls-24" x="259.18" y="137.54" width="2.72" height="2.72" />
      <rect class="cls-24" x="233.34" y="137.54" width="5.32" height="2.72" />
      <rect class="cls-24" x="189.31" y="137.09" width="4.69" height="3.62" />
      <rect class="cls-24" x="94.66" y="22.94" width="2.72" height="2.72" />
      <rect class="cls-24" x="117.71" y="22.94" width="2.72" height="2.72" />
      <rect class="cls-24" x="140.62" y="22.94" width="2.72" height="2.72" />
      <rect class="cls-24" x="155.24" y="22.94" width="2.72" height="2.72" />
      <rect class="cls-24" x="175.73" y="22.94" width="2.72" height="2.72" />
      <rect class="cls-24" x="190.35" y="22.94" width="2.72" height="2.72" />
      <rect class="cls-24" x="213.12" y="22.94" width="2.72" height="2.72" />
      <rect class="cls-24" x="232.06" y="91.63" width="7.12" height="2.75" />
      <rect class="cls-24" x="232.06" y="114.44" width="7.12" height="2.75" />
      <circle class="cls-24" cx="191.83" cy="93.11" r="2.07" />
      <circle class="cls-24" cx="191.83" cy="115.81" r="2.07" />
    </g>
  </svg>
</template>
<style lang="scss" scoped>
svg {
  @include size(100%);
}
.cls-12 {
  fill: #fffbbd;
}
.cls-13 {
  fill: #231815;
}
.cls-21,
.cls-22,
.cls-23 {
  fill: none;
  stroke: #9fa0a0;
  stroke-miterlimit: 10;
}
.cls-22 {
  stroke-width: 0.5px;
}
.cls-23 {
  stroke-width: 0.25px;
}
.cls-24 {
  fill: #595757;
}
</style>
